services = {
    'RU': {
        '⚡️ Электроэнергия': 131,
        '⛽️ Природный газ': 134,
        '⚙️ Изменить язык': 1
    },
    'UZ': {
        '⚡️ Elektr energiyasi': 131,
        '⛽️ Tabiiy gaz': 134,
        '⚙️ Tilni o\'zgartirish': 1,
    },
    'EN': {
        '⚡️ Electricity': 131,
        '⛽️ Natural gas': 134,
        '⚙️ Change language': 1
    }
}


areas = {
    'RU': {
        'Ташкент': 0,
        'Ташкентская область': 1,
        'Андижан': 2,
        'Бухара': 3,
        'Джизак': 4,
        'Кашкадарья': 5,
        'Навои': 6,
        'Наманган': 7,
        'Самарканд': 8,
        'Сурхандарья': 9,
        'Сырдарья': 10,
        'Фергана': 11,
        'Хорезм': 12,
        'Каракалпакстан': 13
    },
    'UZ': {
        'Toshkent': 0,
        'Toshkent viloyati': 1,
        'Andijon': 2,
        'Buxoro': 3,
        'Jizzax': 4,
        'Qashqadaryo': 5,
        'Navoi': 6,
        'Namangan': 7,
        'Samarqand': 8,
        'Surxandaryo': 9,
        'Sirdaryo': 10,
        'Farg\'ona': 11,
        'Xorazm': 12,
        'Qoraqalpoqiston': 13
    },
    'EN': {
        'Tashkent': 0,
        'Tashkent region': 1,
        'Andijan': 2,
        'Buxara': 3,
        'Jizzax': 4,
        'Kashkadarya': 5,
        'Navoi': 6,
        'Namangan': 7,
        'Samarkand': 8,
        'Surxandarya': 9,
        'Sirdarya': 10,
        'Fergana': 11,
        'Xorazm': 12,
        'Karakalpakistan': 13
    }
}

cities = [
    {
        "Tashkent": [
            {"Алмазарский ЭП": "26280"},
            {"Бектемирский ЭП": "26264"},
            {"Мирабадский ЭП": "26273"},
            {"Мирзо": "26269"},
            {"Сергелийский ЭП": "26283"},
            {"Учтепинский ЭП": "26262"},
            {"Яшнабадский ЭП": "26290"},
            {"Чиланзарский ЭП": "26294"},
            {"Шайхантахурский ЭП": "26277"},
            {"Юнусабадский ЭП": "26266"},
            {"Яккасарайский ЭП": "26287"},
        ]
    },
    {
        "Tashkent region": [
            {"Аккурганское ЭСП": "27206"},
            {"Алмалыкское ЭСП": "27404"},
            {"Ангренское ЭСП": "27407"},
            {"Ахангаранское ЭСП": "27212"},
            {"Бекабадское ЭСП": "27413"},
            {"Бостанлыкское ЭСП": "27224"},
            {"Букинское ЭСП": "27228"},
            {"Зангиатинское ЭСП": "27238"},
            {"Зафарское ЭСП": "27220"},
            {"Кибрайское ЭСП": "27248"},
            {"Куйичирчикское ЭСП": "27233"},
            {"Паркентское ЭСП": "27249"},
            {"Пскентское ЭСП": "27250"},
            {"Ташкентское ЭСП": "27237"},
            {"Уртачирчикское ЭСП": "27253"},
            {"Чиназское ЭСП": "27256"},
            {"Чирчикское ЭСП": "27419"},
            {"Юкоричирчикское ЭСП": "27239"},
            {"Янгиюльское ЭСП": "27259"},
        ]
    },
    {
        "Andijan": [
            {"Алтынкульское ЭСП": "03202"},
            {"Андижан Бобур ГорЭСП": "03403"},
            {"Андижан Энергосотиш": "03400"},
            {"Андижан эски ГорЭСП": "03404"},
            {"Андижан янги ГорЭСП": "03401"},
            {"Андижанское ЭСП": "03203"},
            {"Асака ГорЭСП": "03405"},
            {"Асакинское ЭСП": "03224"},
            {"Балыкчинское ЭСП": "03206"},
            {"Бозское ЭСП": "03209"},
            {"Булакбашинское ЭСП": "03210"},
            {"Джалалкудукское ЭСП": "03211"},
            {"Избасканское ЭСП": "03214"},
            {"Куйганёрский ЭСП": "03204"},
            {"Кургантепинское ЭСП": "03220"},
            {"Мархаматское ЭСП": "03227"},
            {"Пахтаабадское ЭСП": "03232"},
            {"Улугноpское ЭСП": "03217"},
            {"Ханабад ГорЭСП": "03408"},
            {"Ходжаабадское ЭСП": "03236"},
            {"Чинабадское ЭСП": "03207"},
            {"Шахрихан ГорЭСП": "03231"},
            {"Шахриханское ЭСП": "03230"},
        ]
    },
    {
        "Buxara": [
            {"Алатское ЭСП": "06204"},
            {"Бухара ГорЭСП": "06401"},
            {"Бухара Энергосотиш": "06400"},
            {"Бухара Энергосотиш": "06500"},
            {"Бухарское ЭСП": "06207"},
            {"Вабкентское ЭСП": "06212"},
            {"Гиждуванское ЭСП": "06215"},
            {"Жондорское ЭСП": "06246"},
            {"Каганское ЭСП": "06219"},
            {"Каракульское ЭСП": "06230"},
            {"Караулбазарское ЭСП": "06232"},
            {"Пешкунское ЭСП": "06240"},
            {"Ромитанское ЭСП": "06242"},
            {"Шафирканское ЭСП": "06258"},
        ]
    },
    {
        "Jizzax": [
            {"Арнасайское ЭСП": "08201"},
            {"Бахмальское ЭСП": "08204"},
            {"Галляаральское ЭСП": "08209"},
            {"Джиззак ГорЭСП": "08402"},
            {"Джиззак Энергосотиш": "08400"},
            {"Шараф Рашидоское ЭСП": "08212"},
            {"Дустликское ЭСП": "08215"},
            {"Зааминское ЭСП": "08218"},
            {"Зарбдорское ЭСП": "08220"},
            {"Зафарабадское ЭСП": "08225"},
            {"Мирзачульское ЭСП": "08223"},
            {"Пахтакорское ЭСП": "08228"},
            {"Фаришское ЭСП": "08235"},
            {"Янгиободское ЭСП": "08237"},
        ]
    },
    {
        "Kashkadarya": [
            {"Баходирстанское ЭСП": "10231"},
            {"Гузарское ЭСП": "10207"},
            {"Дехканабадское ЭСП": "10212"},
            {"Камашинское ЭСП": "10220"},
            {"Карши ГорЭСП": "10401"},
            {"Карши Энергосотиш": "10500"},
            {"Карши Энергосотиш": "10400"},
            {"Каршинское ЭСП": "10224"},
            {"Касанское ЭСП": "10229"},
            {"Касбинское ЭСП": "10237"},
            {"Китабское ЭСП": "10232"},
            {"Миришкорское ЭСП": "10233"},
            {"Мурабекское ЭСП": "10234"},
            {"Нишанское ЭСП": "10235"},
            {"Чиракчинское ЭСП": "10242"},
            {"Шахрисабз ГорЭСП": "10246"},
            {"Шахрисабзское ЭСП": "10245"},
            {"Яккабагское ЭСП": "10250"},
        ]
    },
    {
        "Navoi": [
            {"Заравшан ГорЭСП": "12408"},
            {"Канимехское ЭСП": "12211"},
            {"Карманинское ЭСП": "12234"},
            {"Кызылтепинское ЭСП": "12216"},
            {"Навбахорское ЭСП": "12230"},
            {"Навои ГорЭСП": "12401"},
            {"Навои Энергосотиш": "12402"},
            {"Навои Энергосотиш": "12400"},
            {"Нуратинское ЭСП": "12238"},
            {"Тамдынское ЭСП": "12244"},
            {"Учкудукское ЭСП": "12248"},
            {"Хатырчинское ЭСП": "12251"},
        ]
    },
    {
        "Namangan": [
            {"Касансайское ЭСП": "14207"},
            {"Мингбулакское ЭСП": "14204"},
            {"Наманган Истикбол ЭСП": "14405"},
            {"Наманган ш. Марказ": "14401"},
            {"Наманган Дустлик ГорЭСП": "14402"},
            {"Наманган Энергосотиш": "14403"},
            {"Наманган ш. Марказ ЭСП": "14404"},
            {"Наманганское ЭСП": "14212"},
            {"Нарынское ЭСП": "14216"},
            {"Папское ЭСП": "14219"},
            {"Туракурганское ЭСП": "14224"},
            {"Уйчинское ЭСП": "14229"},
            {"Учкурганское ЭСП": "14234"},
            {"Чартакское ЭСП": "14236"},
            {"Чустское ЭСП": "14237"},
            {"Янгикурганское ЭСП": "14242"},
        ]
    },
    {
        "Samarkand": [
            {"Акдарьинское ЭСП": "18203"},
            {"Багишамальское ЭСП": "18408"},
            {"Булунгурское ЭСП": "18206"},
            {"Гузалкентский ЭСП": "18228"},
            {"Дехканобадское ЭСП": "18237"},
            {"Дехканабадское ЭСП": "18239"},
            {"Джамбайское ЭСП": "18209"},
            {"Дустликское ЭСП": "18233"},
            {"Зарафшанское ЭСП": "18234"},
            {"Иштыханское ЭСП": "18212"},
            {"Карадарьинское ЭСП": "18214"},
            {"Каттакурганское ЭСП": "18215"},
            {"Кошрабадское ЭСП": "18216"},
            {"Нарпайское ЭСП": "18218"},
            {"Нурабадское ЭСП": "18235"},
            {"Пайарыкское ЭСП": "18224"},
            {"Пастдаргомское ЭСП": "18227"},
            {"Пахтачийское ЭСП": "18230"},
            {"Самарканд Энергосотиш": "18400"},
            {"Сиабское ЭСП": "18407"},
            {"Тайлякское ЭСП": "18238"},
            {"Темирйульское ЭСП": "18405"},
            {"Ургутское ЭСП": "18236"},
            {"Челекское ЭСП": "18225"},
            {"Челекское ЭСП": "18226"},
        ]
    },
    {
        "Surxandarya": [
            {"Алтынсайское ЭСП": "22201"},
            {"Ангорское ЭСП": "22202"},
            {"Байсунское ЭСП": "22204"},
            {"Бандиханское ЭСП": "22206"},
            {"Денауский ГорЭСП": "22211"},
            {"Денауское ЭСП": "22210"},
            {"Джаркурганское ЭСП": "22212"},
            {"Кизиркское ЭСП": "22215"},
            {"Кумкурганское ЭСП": "22214"},
            {"Музрабадское ЭСП": "22207"},
            {"Сариасийское ЭСП": "22217"},
            {"Сурхандарья Энергосотиш": "22400"},
            {"Термез ГорЭСП": "22401"},
            {"Термезское ЭСП": "22220"},
            {"Узунское ЭСП": "22221"},
            {"Шерабадское ЭСП": "22223"},
            {"Шурчинское ЭСП": "22226"},
        ]
    },
    {
        "Sirdarya": [
            {"Сырдарьинское ЭСП": "24231"},
            {"Акалтынское ЭСП": "24206"},
            {"Баяутское ЭСП": "24212"},
            {"Гулистан ГорЭСП": "24401"},
            {"Гулистанское ЭСП": "24220"},
            {"Мирзаабадское ЭСП": "24228"},
            {"Сайхунабадское ЭСП": "24216"},
            {"Сардобское ЭСП": "24226"},
            {"Сырдарья Энергосотиш": "24402"},
            {"Хавастское ЭСП": "24235"},
            {"Ширин ГорЭСП": "24410"},
            {"Янгиер ГорЭСП": "24413"},
        ]
    },
    {
        "Fergana": [
            {"Алтыарыкское ЭСП": "30203"},
            {"Багдадское ЭСП": "30209"},
            {"Бешарыкское ЭСП": "30215"},
            {"Бувайдинское ЭСП": "30212"},
            {"Дангаринское ЭСП": "30236"},
            {"Киргулинское ЭСП": "30402"},
            {"Киргулинское ЭСП": "30403"},
            {"Коканд ГорЭСП": "30405"},
            {"Кувасай ГорЭСП": "30408"},
            {"Кувинское ЭСП": "30218"},
            {"Куштепинское ЭСП": "30206"},
            {"Маргилан ГорЭСП": "30412"},
            {"Риштанское ЭСП": "30224"},
            {"Сохское ЭСП": "30226"},
            {"Ташлакское ЭСП": "30227"},
            {"Узбекистанское ЭСП": "30230"},
            {"Учкуприкское ЭСП": "30221"},
            {"Фергана ГорЭСП": "30401"},
            {"Фергана Энергосотиш": "30400"},
            {"Ферганское ЭСП": "30233"},
            {"Фуркатское ЭСП": "30238"},
            {"Язъяванское ЭСП": "30242"},
        ]
    },
    {
        "Xorazm": [
            {"Багатское ЭСП": "33204"},
            {"Гурленское ЭСП": "33208"},
            {"Кошкупырское ЭСП": "33212"},
            {"Питняк ГорЭСП": "33402"},
            {"Ургенч ГорЭСП": "33401"},
            {"Ургенчкое ЭСП": "33217"},
            {"Хазараспское ЭСП": "33220"},
            {"Ханкинское ЭСП": "33223"},
            {"Хива ГорЭСП": "33406"},
            {"Хивинское ЭСП": "33226"},
            {"Хорезм Энергосотиш": "33400"},
            {"Шаватское ЭСП": "33230"},
            {"Янгиарыкское ЭСП": "33233"},
            {"Янгибазарское": "33236"},
        ]
    },
]

languages = {
    'Русский': 'RU',
    'O\'zbek': 'UZ',
    'English': 'EN'
}

welcome = "Здравствуйте, выберите язык\n" \
          "Assalomu Alaykum, tilni tanlang\n" \
          "Hello, choose a language\n"

messages = {
    'RU': {
        'choose_request': 'Выберите необходимую услугу',
        'area_request': 'Выберите необходимую область',
        'city_request': 'Выберите необходимый город',
        'account_id': 'Введите 7 значный номер счета, например: <em>0077777</em>',
        'electricity': '📜 Услуга: {service}\n'
                       '👤 Ф.И.О: {name}\n'
                       '📍 Регион: {region}\n'
                       '📔 Код района: {code}\n'
                       '📄 Лицевой счет: {account_id}\n'
                       '📞 Оператор: {operator}\n'
                       '⏱ Время: {time}\n'
                       '💰 Баланс: {balance}\n'
                       '📆 Дата последнего платежа: {last_pay}\n'
                       '💸 Сумма последнего платежа: {last_pay_count}\n',
        'gas': '📜 Услуга: {service}\n'
               '👤 Ф.И.О: {name}\n'
               '📍 Регион: {region}\n'
               '📔 Код района: {code}\n'
               '📄 Лицевой счет: {account_id}\n'
               '🗺 Адрес: {address}\n'
               '📞 Оператор: {operator}\n'
               '📆 Период: {period}\n'
               '⏱ Время: {time}\n'
               '🧭 Показание счетчика: {count_now}\n'
               '🧭 Расчетный показатель счетчика: {count_until}\n'
               '💰 Остаток на начало месяца: {start_balance}\n'
               '💰 Остаток на конец месяца: {end_balance}\n'
    },
    'UZ': {
        'choose_request': 'Kerakli xizmatni tanlang',
        'area_request': 'Kerakli viloyatni tanlang',
        'city_request': 'Kerakli shaharni tanlang',
        'account_id': '7 xonali xisob raqamini kiriting, masalan: <em>0077777</em>',
        'electricity': '📜 Xizmat: {service}\n'
                       '👤 F.I.SH: {name}\n'
                       '📍 Viloyat: {region}\n'
                       '📔 Shahar kodi: {code}\n'
                       '📄 Xisob raqami: {account_id}\n'
                       '📞 Operator: {operator}\n'
                       '⏱ Vaqt: {time}\n'
                       '💰 Balans: {balance}\n'
                       '📆 Oxirgi to\'lov sanasi: {last_pay}\n'
                       '💸 Oxirgi to\'lov summasi: {last_pay_count}\n',
        'gas': '📜 Xizmat: {service}\n'
               '👤 F.I.SH: {name}\n'
               '📍 Viloyat: {region}\n'
               '📔 Shahar kodi: {code}\n'
               '📄 Xisob raqami: {account_id}\n'
               '🗺 Manzil: {address}\n'
               '📞 Operator: {operator}\n'
               '📆 Davr: {period}\n'
               '⏱ Vaqt: {time}\n'
               '🧭 Xisoblagich ko\'rsatkichi: {count_now}\n'
               '🧭 To\'langan xisoblagich ko\'rsatkichi: {count_until}\n'
               '💰 Oy boshiga qoldiq: {start_balance}\n'
               '💰 Oy oxiriga qoldiq: {end_balance}\n'
               '📆 Oxirgi to\'lov sanasi: {last_pay}\n',
    },
    'EN': {
        'choose_request': 'Select the required service',
        'area_request': 'Select the desired area',
        'city_request': 'Select the desired city',
        'account_id': 'Enter a 7 digit account number, for example: <em>0077777</em>',
        'electricity': '📜 Service: {service}\n'
                       '👤 L.F.P: {name}\n'
                       '📍 Region: {region}\n'
                       '📔 Region code: {code}\n'
                       '📄 Personal account: {account_id}\n'
                       '📞 Operator: {operator}\n'
                       '⏱ Date: {time}\n'
                       '💰 Balance: {balance}\n'
                       '📆 Date of last payment: {last_pay}\n'
                       '💸 The amount of the last payment: {last_pay_count}\n',
        'gas': '📜 Service: {service}\n'
               '👤 L.F.P: {name}\n'
               '📍 Region: {region}\n'
               '📔 Region code: {code}\n'
               '📄 Personal account: {account_id}\n'
               '🗺 Address: {address}\n'
               '📞 Operator: {operator}\n'
               '📆 Period: {period}\n'
               '⏱ Date: {time}\n'
               '🧭 Counter indicator: {count_now}\n'
               '🧭 Calculated meter indicator: {count_until}\n'
               '💰 Balance at the beginning of the month: {start_balance}\n'
               '💰 Balance at the end of the month: {end_balance}\n',
    }
}

errors = {
    'RU': {
        'digit_error': 'Пожалуйста, вводите только числовые значения',
        'len_error': 'Пожалуйста, вводите только 7 значный номер счета',
        'account_error': 'Неверный номер лицевого счета. Попробуйте еще раз'
    },
    'UZ': {
        'digit_error': 'Iltimos faqat raqam kiriting',
        'len_error': 'Iltimos faqat 7 xonali xisob raqamini kiriting',
        'account_error': 'Notogri xisob raqami. Yana bir bor urinib ko\'ring'
    },
    'EN': {
        'digit_error': 'Please enter numeric values only',
        'len_error': 'Please enter a 7 digit account number only',
        'account_error': 'Invalid personal account number. Try again'
    }
}
